Revit 2027 API
DetailElementOrderUtils.BringForward Method
Overload List
Name | Description
BringForward(Document, View, ElementId) |  Moves the given detail instance one step closer to the front of all other detail instances in the view.
BringForward(Document, View, ICollection<ElementId>) |  Moves the given detail instances one step closer to the front of all other detail instances in the view, while keeping the order of the given ones.
Top
See Also
Reference
DetailElementOrderUtils Class
Autodesk.Revit.DB Namespace